In [1]:
!pip install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/b5/ac/5ec0601ce698235cad8559dfe0ae5ace903a359d617a8c4c033f9879faf8/pandas-1.1.5-cp37-cp37m-macosx_10_9_x86_64.whl (10.0MB)
    100% |████████████████████████████████| 10.0MB 4.8MB/s ta 0:00:01
Requirement already satisfied: python-dateutil>=2.7.3 in ./venv/lib/python3.7/site-packages (from pandas) (2.8.1)
Collecting pytz>=2017.2 (from pandas)
  Downloading https://files.pythonhosted.org/packages/70/94/784178ca5dd892a98f113cdd923372024dc04b8d40abe77ca76b5fb90ca6/pytz-2021.1-py2.py3-none-any.whl (510kB)
    100% |████████████████████████████████| 512kB 22.5MB/s ta 0:00:01
Collecting numpy>=1.15.4 (from pandas)
  Downloading https://files.pythonhosted.org/packages/ef/d6/8f0458d22383a63d953ddfd41444f4c21783d75b0d19e1373d4ab7456add/numpy-1.20.0-cp37-cp37m-macosx_10_9_x86_64.whl (16.0MB)
    100% |████████████████████████████████| 16.0MB 3.1MB/s eta 0:00:01
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.20.0 pandas-1.1.5 pytz-2021.1

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(columns=['Name', 'Age', 'Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [4]:
df.loc[0] = ['Allen', '22', '175']
df

    Name Age Height
0  Allen  22    175

In [5]:
df.loc[1] = ['Ted', '25', '180']
df.loc[2] = ['Jack', '28', '175']
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    175

In [6]:
df['Weight'] = ['75', '80', '70']
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Jack  28    175     70

In [7]:
df.drop(['Weight'], axis=1)

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    175

In [10]:
df.drop(2)

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80

In [11]:
df = df.drop(['Weight'], axis=1)
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    175

In [12]:
df = df.drop(2)
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [13]:
df.loc[0] = 'AAA'
df

  Name  Age Height
0  AAA  AAA    AAA
1  Ted   25    180

In [14]:
df['Height'] = "500"

In [15]:
df

  Name  Age Height
0  AAA  AAA    500
1  Ted   25    500

In [16]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Allen', '22', '175'],
    ['Ted', '25', '180'],
    ['Jack', '28', '170']
]

df2 = pd.DataFrame(data=data, columns=columns)
df2

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170

In [17]:
df2.append(df)

    Name  Age Height
0  Allen   22    175
1    Ted   25    180
2   Jack   28    170
0    AAA  AAA    500
1    Ted   25    500

In [19]:
df2 = df2.append(df)
df2

    Name  Age Height
0  Allen   22    175
1    Ted   25    180
2   Jack   28    170
0    AAA  AAA    500
1    Ted   25    500

In [21]:
df2.reset_index(drop=True)

    Name  Age Height
0  Allen   22    175
1    Ted   25    180
2   Jack   28    170
3    AAA  AAA    500
4    Ted   25    500

In [23]:
df2 = df2.reset_index(drop=True)

In [24]:
df2

    Name  Age Height
0  Allen   22    175
1    Ted   25    180
2   Jack   28    170
3    AAA  AAA    500
4    Ted   25    500

In [25]:
df2['Name']

0    Allen
1      Ted
2     Jack
3      AAA
4      Ted
Name: Name, dtype: object